In [35]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [101]:
import numpy as np
import pandas as pd

In [37]:
df = pd.DataFrame(people)

In [38]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [39]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [40]:
df['full_name'] = df['first'] + ' ' + df['last']

In [41]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [42]:
df.drop(columns=['first', 'last'], inplace=True)

In [43]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [44]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [45]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [46]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [47]:
df.append({'first': 'Tony'}, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [48]:
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [49]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [50]:
df.append(df2, ignore_index=True, sort=False)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [51]:
df = df.append(df2, ignore_index=True, sort=False)

In [67]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [52]:
df.drop(index=4)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [53]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [54]:
df[df['last'] != 'Doe']

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [76]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [81]:
df.loc[[1,0,1,0,1],['email', 'last']]

                     email     last
1        JaneDoe@email.com      Doe
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

In [84]:
df.append(df.loc[[1,0,1,0,1],['email', 'last']], sort=True)

                     email  first      full_name     last
0  CoreyMSchafer@gmail.com  Corey  Corey Schafer  Schafer
1        JaneDoe@email.com   Jane       Jane Doe      Doe
2        JohnDoe@email.com   John       John Doe      Doe
3       IronMan@avenge.com   Tony            NaN    Stark
4           Cap@avenge.com  Steve            NaN   Rogers
1        JaneDoe@email.com    NaN            NaN      Doe
0  CoreyMSchafer@gmail.com    NaN            NaN  Schafer
1        JaneDoe@email.com    NaN            NaN      Doe
0  CoreyMSchafer@gmail.com    NaN            NaN  Schafer
1        JaneDoe@email.com    NaN            NaN      Doe

In [99]:
s = df['first'].str.isalnum()
s.dtype

dtype('bool')

In [118]:
df1 = pd.DataFrame(np.random.randn(6, 4),
                   index=list(range(0, 12, 2)),
                   columns=list(range(0, 8, 2)))

In [119]:
df1

           0         2         4         6
0   1.172321  1.447744  1.369546 -1.189925
2   0.338187 -0.568795 -0.802227 -1.189978
4  -0.291473 -0.595166  0.512757  0.060468
6  -0.528625 -0.487863  0.796713  1.028018
8   1.041104  0.930448  0.675781 -1.063259
10 -1.492771  0.558982 -0.205612 -1.083702

In [124]:
df1.iloc[[0,1,2,3],[0,1,2,3]]

          0         2         4         6
0  1.172321  1.447744  1.369546 -1.189925
2  0.338187 -0.568795 -0.802227 -1.189978
4 -0.291473 -0.595166  0.512757  0.060468
6 -0.528625 -0.487863  0.796713  1.028018

In [126]:
df = pd.DataFrame({'vals': [1, 2, 3, 4], 'ids': ['a', 'b', 'f', 'n'],
                   'ids2': ['a', 'n', 'c', 'n']})

In [134]:
df

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c
3     4   n    n

In [136]:
values = {'vals': [1, 2], 'ids': ['a', 'b', 'f', 'n'],
                   'ids2': ['z']}
df.loc[:, df.isin(values).any()]

   vals ids
0     1   a
1     2   b
2     3   f
3     4   n